## Questions
<ul>
    <li><del>What range of years does the provided database cover?</del></li>
<br> 
<li><del>Find the name and height of the shortest player in the database. How many games did he play in? What is the name of the team for which he played?</del></li>
<br> 
<li><del>Find all players in the database who played at Vanderbilt University. Create a list showing each player’s first and last names as well as the total salary they earned in the major leagues. Sort this list in descending order by the total salary earned. Which Vanderbilt player earned the most money in the majors?</del></li>
<br> 
<li><del>Using the fielding table, group players into three groups based on their position: label players with position OF as "Outfield", those with position "SS", "1B", "2B", and "3B" as "Infield", and those with position "P" or "C" as "Battery". Determine the number of putouts made by each of these three groups in 2016.</del></li>
<br> 
<li>Find the average number of strikeouts per game by decade since 1920. Round the numbers you report to 2 decimal places. Do the same for home runs per game. Do you see any trends?</li>
<br> 
<li>Find the player who had the most success stealing bases in 2016, where success is measured as the percentage of stolen base attempts which are successful. (A stolen base attempt results either in a stolen base or being caught stealing.) Consider only players who attempted at least 20 stolen bases.</li>
<br> 
<li>From 1970 – 2016, what is the largest number of wins for a team that did not win the world series? What is the smallest number of wins for a team that did win the world series? Doing this will probably result in an unusually small number of wins for a world series champion – determine why this is the case. Then redo your query, excluding the problem year. How often from 1970 – 2016 was it the case that a team with the most wins also won the world series? What percentage of the time?</li>
<br> 
<li>Using the attendance figures from the homegames table, find the teams and parks which had the top 5 average attendance per game in 2016 (where average attendance is defined as total attendance divided by number of games). Only consider parks where there were at least 10 games played. Report the park name, team name, and average attendance. Repeat for the lowest 5 average attendance.</li>
<br> 
<li>Which managers have won the TSN Manager of the Year award in both the National League (NL) and the American League (AL)? Give their full name and the teams that they were managing when they won the award.</li> 
</ul>

## Bonus Questions
<ul>
<li>Analyze all the colleges in the state of Tennessee. Which college has had the most success in the major leagues. Use whatever metric for success you like - number of players, number of games, salaries, world series wins, etc.</li>
<br>
<li>Is there any correlation between number of wins and team salary? Use data from 2000 and later to answer this question. As you do this analysis, keep in mind that salaries across the whole league tend to increase together, so you may want to look on a year-by-year basis.</li>
<br>
<li>It is thought that since left-handed pitchers are more rare, causing batters to face them less often, that they are more effective. Investigate this claim and present evidence to either support or dispute this claim. First, determine just how rare left-handed pitchers are compared with right-handed pitchers. Are left-handed pitchers more likely to win the Cy Young Award? Are they more likely to make it into the hall of fame?</li>

In [1]:
import os

import pandas as pd
from sqlalchemy import create_engine
import numpy as np

In [2]:
from dotenv import load_dotenv
load_dotenv()

True

In [3]:
username = os.getenv('POSTGRES_USERNAME')
password = os.getenv('POSTGRES_PASSWORD')


postgres_connection_string = "postgres://{username}:{password}@{host}:{port}/{database}?gssencmode=disable".format(
    username=username,
    password=password,
    host="localhost",
    port="5432",
    database="lahman_baseball"
)

In [4]:
engine = create_engine(postgres_connection_string)

In [5]:
batting_sql = "SELECT * FROM batting;"
teams_sql = "SELECT * FROM teams;"
people_sql = "SELECT * FROM people;"
appearances_sql = "SELECT * FROM appearances;"
collegeplaying_sql = "SELECT * FROM collegeplaying;"
schools_sql = "SELECT * FROM schools;"
salaries_sql = "SELECT * FROM salaries;"
fielding_sql = "SELECT * FROM fielding;"
pitching_sql = "SELECT * FROM pitching;"

In [6]:
batting_df = pd.read_sql(batting_sql, con=engine)
teams_df = pd.read_sql(teams_sql, con=engine)
people_df = pd.read_sql(people_sql, con=engine)
appearances_df = pd.read_sql(appearances_sql, con=engine)
collegeplaying_df = pd.read_sql(collegeplaying_sql, con=engine)
schools_df = pd.read_sql(schools_sql, con=engine)
salaries_df = pd.read_sql(salaries_sql, con=engine)
fielding_df = pd.read_sql(fielding_sql, con=engine)
pitching_df = pd.read_sql(pitching_sql, con=engine)

---
#### What range of years does the provided database cover?

In [7]:
teams_df['yearid'].min()

1871

In [8]:
teams_df['yearid'].max()

2016

---
#### Find the name and height of the shortest player in the database. How many games did he play in? What is the name of the team for which he played?

In [9]:
shortest_player = people_df[people_df.height == people_df.height.min()]

In [10]:
shortest_player['namegiven']

5843    Edward Carl
Name: namegiven, dtype: object

In [11]:
edward_carl_id = list(shortest_player['playerid'])

In [12]:
appearances_df[appearances_df['playerid'].isin(['gaedeed01'])]

,yearid,teamid,lgid,playerid,g_all,gs,g_batting,g_defense,g_p,g_c,...,g_2b,g_3b,g_ss,g_lf,g_cf,g_rf,g_of,g_dh,g_ph,g_pr
35173,1951,SLA,AL,gaedeed01,1,0.0,1,0,0,0,...,0,0,0,0,0,0,0,0.0,1.0,0.0

In [13]:
teams_df['name'][teams_df['teamid'].isin(['SLA'])].head(1)

412    St. Louis Browns
Name: name, dtype: object

---
#### Find all players in the database who played at Vanderbilt University. Create a list showing each player’s first and last names as well as the total salary they earned in the major leagues. Sort this list in descending order by the total salary earned. Which Vanderbilt player earned the most money in the majors?

In [14]:
vandy_id = list(schools_df.loc[schools_df['schoolname'] == 'Vanderbilt University', 'schoolid'])

In [15]:
vandy_players = list(collegeplaying_df.loc[collegeplaying_df['schoolid'] == 'vandy', 'playerid'])

In [16]:
# function to get unique values 
def unique(list1): 
    x = np.array(list1) 
    print(np.unique(x))

In [17]:
unique(vandy_players)

['alvarpe01' 'baxtemi01' 'chrisni01' 'colliwi01' 'corajo01' 'embresl01'
 'flahery01' 'grayso01' 'hendrha01' 'katama01' 'lewisje01' 'madissc01'
 'minormi01' 'mooresc01' 'mossma01' 'pauljo01' 'priceda01' 'priorma01'
 'richaan01' 'sandesc01' 'sewelri01' 'sowerje01' 'willimi01' 'zeidjo01']

In [18]:
#Placed a comma between all items returned above.
vandy_players_unique = ['alvarpe01', 'baxtemi01', 'chrisni01', 'colliwi01', 'corajo01', 'embresl01',
 'flahery01', 'grayso01', 'hendrha01', 'katama01', 'lewisje01', 'madissc01',
 'minormi01', 'mooresc01', 'mossma01', 'pauljo01', 'priceda01', 'priorma01',
 'richaan01', 'sandesc01', 'sewelri01', 'sowerje01', 'willimi01', 'zeidjo01']

In [19]:
vandy_names = people_df.query('playerid in @vandy_players_unique')

In [20]:
vandy_names_fl = vandy_names[['playerid', 'namefirst', 'namelast']]

In [21]:
vandy_salaries = salaries_df.query('playerid in @vandy_players_unique')

In [22]:
vandy_total_salaries = vandy_salaries.groupby('playerid')['salary'].sum().to_frame()

In [23]:
pd.merge(vandy_total_salaries, vandy_names_fl, on = 'playerid').sort_values(by = 'salary', ascending = False).head(1)

     playerid      salary namefirst namelast
11  priceda01  81851296.0     David    Price

---

#### Using the fielding table, group players into three groups based on their position: label players with position OF as "Outfield", those with position "SS", "1B", "2B", and "3B" as "Infield", and those with position "P" or "C" as "Battery". Determine the number of putouts made by each of these three groups in 2016.

In [24]:
fielding_df['pos_group'] = fielding_df['pos']

In [25]:
fielding_df.loc[fielding_df['pos'] == '1B', 'pos_group'] = 'Infield'
fielding_df.loc[fielding_df['pos'] == '2B', 'pos_group'] = 'Infield'
fielding_df.loc[fielding_df['pos'] == 'SS', 'pos_group'] = 'Infield'
fielding_df.loc[fielding_df['pos'] == '3B', 'pos_group'] = 'Infield'
fielding_df.loc[fielding_df['pos'] == 'OF', 'pos_group'] = 'Outfield'
fielding_df.loc[fielding_df['pos'] == 'P', 'pos_group'] = 'Battery'
fielding_df.loc[fielding_df['pos'] == 'C', 'pos_group'] = 'Battery'

In [26]:
fielding_df.groupby('pos_group')['po'].sum().to_frame()

                po
pos_group
Battery    2575499
Infield    6101378
Outfield   2731506

---
#### Find the average number of strikeouts per game by decade since 1920. Round the numbers you report to 2 decimal places. Do the same for home runs per game. Do you see any trends?

In [35]:
so_by_decade = pitching_df[pitching_df['yearid'] >= 1920]

In [36]:
so_by_decade.columns

Index(['playerid', 'yearid', 'stint', 'teamid', 'lgid', 'w', 'l', 'g', 'gs',
       'cg', 'sho', 'sv', 'ipouts', 'h', 'er', 'hr', 'bb', 'so', 'baopp',
       'era', 'ibb', 'wp', 'hbp', 'bk', 'bfp', 'gf', 'r', 'sh', 'sf', 'gidp'],
      dtype='object')

In [39]:
so_by_decade = so_by_decade.drop(columns = ['playerid', 'stint', 'teamid', 'lgid', 'w', 'l', 'g', 'gs',
       'cg', 'sho', 'sv', 'ipouts', 'h', 'er', 'hr', 'bb', 'baopp',
       'era', 'ibb', 'wp', 'hbp', 'bk', 'bfp', 'gf', 'r', 'sh', 'sf', 'gidp'])

In [40]:
so_by_decade

       yearid   so
6549     1920    9
6550     1920   84
6551     1920  173
6552     1920    4
6553     1920  103
...       ...  ...
44958    2016   17
44959    2016   27
44960    2016   31
44961    2016   66
44962    2016   21

[38414 rows x 2 columns]

In [79]:
#Python is written in C, and native python functions are inherently slower than C, so using for loops is not ideal. 
#Use .apply() instead! (see below)

#decade_list = []

#for year in so_by_decade.yearid:
    #print(year)
    #decade = year//10*10
    #decade_list.append(decade)

In [82]:
#so_by_decade['decade'] = decade_list

In [81]:
#We can define a function 

def calculate_decade(yearid):
    return yearid//10*10

In [70]:
so_by_decade['decade'] = so_by_decade.yearid.apply(calculate_decade)

In [76]:
so_by_decade.groupby('decade')['so'].mean().to_frame()

               so
decade
1920    32.065680
1930    37.520900
1940    35.834626
1950    41.806068
1960    56.255936
1970    53.641917
1980    50.637651
1990    47.333155
2000    46.566253
2010    49.022422

In [78]:
#For plain math functions, you can do it this way, but once the params become more complicated it will not work.

#so_by_decade['decade'] = so_by_decade.yearid//10*10

In [177]:
#engine.dispose()